Repository: 84000/data-translation-memory
Catalog: toh67-v3.tmx
Source language: bo
Languages: en

source: །གང་གིས་ཞི་ཚུལ་མཛེས་རྟོགས་པ། །དེ་ནི་ཚུལ་ཁྲིམས་མཆོག་ཡིན་གསུང་།
en: Understanding the elegant mode of calm Is the supreme moral discipline—so you teach. “ ‘

source: །བཟོད་པ་རྟག་ཏུ་སྒོམ་གྱིས་ལ། །སེམས་ཅན་རྣམས་ལ་རྟོག་མ་བྱེད།
en: By always cultivating patience, Do not engage in thoughts about beings.

source: །རྟོག་པ་ཐམས་ཅད་རྣམ་སྤངས་པ། །དེ་ནི་བཟོད་པ་ཡིན་པར་གསུངས།
en: To renounce all thought Is what patience is—so you teach. “ ‘

source: །བརྩོན་འགྲུས་བརྟན་པའང་བརྩམ་པར་བྱོས།
en: Exercise firm diligence too.

source: །འདུས་བྱས་ཀུན་ཀྱང་སྤང་བར་གྱིས།
en: Give up all compounded things.

source: །དབེན་པར་ལྟ་བ་གང་ཡིན་པ། །དེ་ནི་སངས་རྒྱས་བརྩོན་འགྲུས་གསུང་།
en: To look toward solitude Is the buddhas’ diligence—so you teach. “ ‘

source: །དངོས་པོའི་དངོས་དེ་མེད་པས་ན། །དངོས་པོ་ཐམས་ཅད་བསྲེག་པར་བྱ།
en: Since things have no reality, Burn everything up!

source: །ཉོན་མོངས་མེད་པ་གང་ཡིན་པ། །དེ་ནི་རྟོག་མེད་བསམ་གཏན་ཡིན།
en: The absence of defilements Is thought-free concentration. “ ‘

source: །ཚུ་རོལ་མ་ཡིན་ཕ་རོལ་མིན། །དབུས་སུའང་གནས་པར་མི་བྱ་སྟེ།
en: Rest neither on the near shore nor on the far shore, Nor in between.

source: །དུས་གསུམ་མཉམ་ལྟ་གང་ཡིན་པ། །དེ་ནི་ཤེས་རབ་དམ་པ་ཡིན། །དགོན་པའི་འདུ་ཤེས་བསྒོམ་བྱ་ཞིང་།
en: The view of the equality of the three times Is the supreme wisdom. “ ‘

source: །འདུ་ཤེས་དེ་ལའང་བལྟ་མི་བྱ།
en: Cultivating a conception of the forest, You will not view that conception.

source: །འདུ་ཤེས་གང་ལས་སྐྱེ་འགྱུར་ཏེ།
en: From where does that conception arise?

source: །དེས་དེ་འདུ་ཤེས་མེད་ཅེས་བྱ།
en: Thus, “Conceptions do not exist.” “ ‘

source: །ཆོས་ཀྱི་སྦྱིན་པའི་ཡོན་ཏན་དང་། །དེ་བཞིན་ཕན་ཡོན་རྣམས་ཀྱང་བསྟན།
en: You have taught the good qualities of the gift of Dharma, And also the benefits.

source: །དེ་ཕྱིར་རློམ་སེམས་མེད་པ་ཡིས། །ཇི་ལྟར་ཐོས་པའི་ཆོས་ཀྱང་ཤོད།
en: Therefore, explain the Dharma as it is learned By those without conceit. “ ‘

source: །ཡི་གེ་རྣམས་ནི་ཟད་མེད་དེ། །རང་བཞིན་གྱིས་ནི་གྲུབ་པ་མེད།
en: Letters are inexhaustible, By nature incomplete.

source: །དེ་ཕྱིར་ཆོས་ལ་མི་རློམ་ཞིང་། །ཁྱེད་ཀྱིས་འབྲས་བུ་མེད་མི་བྱ།
en: So do not be conceited about the Dharma, And do not render yourselves fruitless. “ ‘

source: །བདག་ནི་ཆོས་སྟོན་བྱེད་པའོ་ཞེས། །གང་ལ་འདུ་ཤེས་དེ་འབྱུང་བ། །དེས་ནི་ཆོས་ཉིད་མི་ཤེས་པས། །དེ་ནི་བདུད་ཀྱི་ཞགས་པས་བཅིངས།
en: The one in whom the conception “I teach the Dharma” arises Does not know reality— They are bound by Māra’s noose. “ ‘

source: །བདག་གིས་སངས་རྒྱས་མཐོང་ངོ་ཞེས། །གང་ལ་འདུ་ཤེས་དེ་འབྱུང་བ། །དེ་ལ་དེ་མ་ཐག་ཏུ་ནི། །བདུད་རྩི་དུག་ནི་བཏུང་བར་འགྱུར། །གང་ཞིག་རྫོགས་པའི་བྱང་ཆུབ་ནི།
en: The one in whom the conception “I see the buddhas” arises— In that very instant They drink poisoned nectar. “ ‘

source: །རྟོགས་པར་འདོད་དམ་ཉན་ཐོས་སམ། །རང་རྒྱལ་བྱང་ཆུབ་རྟོགས་འདོད་པ། །དེས་ནི་ཚུལ་འདི་བསླབ་པར་གྱིས། །རྣམ་གྲོལ་ཡེ་ཤེས་དཔག་མེད་ཀྱང་། །གཅིག་པ་ཉིད་དུ་བསྟན་པ་མཛད།
en: Whoever wishes to realize Perfect awakening, or the awakening Of the śrāvaka or pratyekabuddha, Should train in this manner: “ ‘Although the wisdom of total liberation is incalculable, Explain it as a unity.

source: །དམན་པའི་སྨོན་ལམ་འདོད་མི་བྱ། །བྱང་ཆུབ་དམ་པ་དོན་དུ་གཉེར།
en: Do not wish for lower aspirations, But strive for supreme awakening. “ ‘

source: །གང་ཞིག་འཇིག་རྟེན་མགོན་པོའི་སྐུ། །མཚན་གྱིས་བརྒྱན་པ་ཅི་འདྲ་བ། །དེ་འདྲ་འདོད་པ་དེ་ཡིས་ནི། །བྱང་ཆུབ་མཆོག་ལ་གནས་པར་གྱིས།
en: Whoever desires the body Of a lord of the world, Adorned by the marks, Should resort to supreme awakening. “ ‘ “

source: །ཆོས་ཀུན་རྒྱུ་ལས་འབྱུང་བ་སྟེ། །བྱེད་པ་པོ་ནི་དམིགས་སུ་མེད།
en: All phenomena arise from causes, But a creator cannot be apprehended.

source: །ཆོས་རྣམས་བརྟེན་ནས་བྱུང་བ་སྟེ། །ཡང་དག་རང་བཞིན་ཡོང་མིན་ཞེས།
en: Phenomena arise dependently, But they do not really, by nature, emerge”— “ ‘Thus you proclaim.

source: །བགྱི་བ་འདི་འདྲ་བཀའ་སྩལ་པ། །དཔའ་ཆེན་ཁྱོད་ནི་ངོ་མཚར་ལགས།
en: Great hero, you are a marvel!’ “

source: །འོད་སྲུང་དེ་ལྟར་ཁྱེའུ་དེ་གཉིས་ཀྱིས་བར་སྣང་དེ་ལས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་པའི་ཚེ་རྒྱལ་པོ་མུ་ཁྱུད་དེའི་གྲོང་ཁྱེར་པ་དང་། བཙུན་མོའི་འཁོར་དང་། ཞབས་འབྲིང་གཉུག་མ་རྣམས་དང་། སྟེང་གི་བར་སྣང་ལ་ལྷ་གང་དག་འདུས་ཏེ་འཁོད་པར་གྱུར་པ་དེ་དག་ལས་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Kāśyapa, when the two youths spoke those verses in that manner in midair, eighty-four thousand living beings from among the inhabitants of King Nimi’s city, his retinue of queens, his servants, and the gods in midair who had gathered and were present generated the thought of unsurpassed, perfect awakening.

source: །སེམས་ཅན་ཚད་མེད། གྲངས་མེད་པ་དག་གིས་ནི་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་ཡོངས་སུ་སྒྲུབ་པའི་རྒྱུ་བསྐྱེད་པར་གྱུར་ཏོ། །འོད་སྲུང་དེ་ནས་ཁྱེའུ་ཆོས་དང་།
en: Immeasurably and countlessly many beings developed the causes of accomplishing various roots of virtue. “

source: ཆོས་བཟང་གཉིས་བར་སྣང་དེ་ལས་བབས་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེའི་ཞབས་ལ་གཏུགས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གཉིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། དམ་པའི་ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ།
en: Then, Kāśyapa, the youths Dharma and Sudharma both descended from the air, touched the feet of the blessed Tathāgata Myriad Flowers, and said, ‘Blessed One, we both go for refuge to the blessed Buddha, to the sublime Dharma, and to the Saṅgha of monks.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་སེམས་ཀྱི་རང་བཞིན་གྱིས་བྱང་ཆུབ་ཀྱི་རང་བཞིན་རྗེས་སུ་རྟོགས་པར་ཡང་བགྱིད་ལགས་ཏེ།
en: We generate the thought of unsurpassed, perfect awakening, while also understanding that the nature of the mind is the nature of awakening.

source: བཅོམ་ལྡན་འདས་འདིར་སེམས་བསྐྱེད་པ་དེ་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་སྐྱེ་བ་མ་མཆིས་པ་ལགས་སོ།
en: Blessed One, in this case, to generate the thought of awakening means that all phenomena are without arising.

source: །འདིར་སེམས་བསྐྱེད་པ་དེ་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མ་མཆིས་པ་ཁོ་ན་ལགས་སོ།
en: In this case, to generate the thought of awakening means there is simply no clinging to any phenomena.

source: གང་ལ་མངོན་པར་ཞེན་པ་མཆིས་པ་དེ་ལ་ནི་སྐྱེ་བ་འགའ་ཞིག་མཆིས་གདའི། གང་ལ་མངོན་པར་ཞེན་པ་མ་མཆིས་པ་དེ་ལ་ནི་སྐྱེ་བ་འགའ་ཡང་མ་མཆིས་པའི་སླད་དུ་སྟེ།
en: It is because wherever there is clinging there is arising, but wherever there is no clinging there is no arising.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་པས་སྐྱེ་བ་ཉིད་སྐྱེ་བ་མ་མཆིས་པ་ལགས་སོ།
en: Since that is so, Blessed One, arising itself has no arising.

source: །དེ་ཅིའི་སླད་དུ་སྐྱེ་བ་མ་མཆིས་པ་ཞེས་བགྱི་ཞེ་ན།
en: Why “no arising”?

source: དེ་ལ་སྐྱེ་བའི་གཞི་འཇུག་པ་མ་མཆིས་པས་དེའི་སླད་དུ་སྐྱེ་བ་མ་མཆིས་པ་ཞེས་བགྱི་སྟེ།
en: Because there is nothing to serve as a basis for arising, there is, for that reason, “no arising.”

source: སྐྱེ་བ་མ་མཆིས་པ་དེ་ལ་ནི་བརྗོད་པ་དེ་ཡང་བརྗོད་པར་མི་བགྱིའོ།
en: As for the absence of arising, that verbal expression is itself inexpressible.

source: ཇི་ཙམ་དུ་བརྗོད་པ་མཆིས་པ་དེ་ཙམ་དུ་སྐྱེ་བ་དང་འགག་པ་མཆིས་ཀྱི།
en: Because, to whatever extent verbal expression exists, to that extent arising and ceasing exist.

source: དེ་ལྟར་ཡེ་ཤེས་ཤིན་ཏུ་རྣམ་པར་དག་པ་གང་ལགས་པ་དེ་ལ་ནི་སྐྱེ་བ་ཡང་མ་མཆིས། འགག་པ་ཡང་མ་མཆིས་ལ།
en: Thus, utterly pure wisdom is without arising and without ceasing.

source: གང་ལ་སྐྱེ་བ་མ་མཆིས་པ་དང་། འགག་པ་མ་མཆིས་པ་དེ་ནི་བས་མ་འཚལ་བ་སྟེ། གཏན་དུ་བས་པ་མ་ལགས་པའི་སླད་དུའོ།
en: That which has no arising and no ceasing is inexhaustible since it is permanently inexhaustible.

source: །བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་པས་བདག་ཅག་གཉིས་ནི་མཉམ་པ་ཉིད་ཀྱི་མཐའ་འདིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་ཤིང་ཆོས་འགའ་ལ་ཡང་དམིགས་པར་མི་བགྱིད། ཆོས་འགའ་ཡང་ཐོབ་པར་མི་བགྱིད། ཆོས་འགའ་ཡང་ཐོབ་པར་བགྱིད་དུ་སྩོལ་བར་མི་བགྱིད་དེ།
en: Blessed One, since this is so, we both pray, on account of the pinnacle of sameness, for supreme and perfect awakening, without apprehending any qualities whatsoever, without attaining any qualities whatsoever, and without seeking to attain any qualities whatsoever.

source: མཉམ་པ་ཉིད་གང་ལགས་པ་དེ་ཁོ་ན་རྗེས་སུ་རྟོགས་པར་བགྱིད་པར་བས་ཀྱི། ཆོས་འགའ་ཡང་རྗེས་སུ་རྟོགས་པར་མི་བགྱིད་ལགས་སོ།
en: We have already understood just that which is sameness, but we do not understand any phenomena whatsoever.

source: ཆོས་ཐམས་ཅད་ནི་གཟོད་མ་ནས་རྣམ་པར་དག་པ་ལགས་པའི་སླད་དུའོ།
en: Because all phenomena are primordially pure.’ “

source: །འོད་སྲུང་དེ་ལྟར་ཁྱེའུ་དེ་གཉིས་ཀྱིས་དེ་སྐད་སྨྲས་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁྲིས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Kāśyapa, when the two youths had spoken thus, ten thousand bodhisattvas attained acceptance that phenomena do not arise.

source: །རྒྱལ་པོ་མུ་ཁྱུད་ཀྱང་བུ་སྟོང་པོ་དེ་དག་དང་ལྷན་ཅིག །རྒྱལ་པོ་ལྔ་སྟོང་དག་དང་ལྷན་ཅིག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: King Nimi, too, together with his thousand sons and five thousand kings, generated the thought of unsurpassed, perfect awakening. “

source: །འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་ཞལ་ཟས་ཀྱི་བྱ་བ་མཛད་པ་ལགས་ནས་ལྷུང་བཟེད་བཞག་སྟེ། ཕྱག་བཅབས་ནས་རྒྱལ་པོ་མུ་ཁྱུད་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་ལ་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད།
en: Then, Kāśyapa, after the Tathāgata Myriad Flowers had eaten lunch, set down his alms bowl, and covered his hands, he delivered a Dharma discourse to King Nimi and those many people, causing them to comprehend it, be inspired by it, and delight in it.

source: ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ།
en: When he had done that, he rose from his seat and departed. “

source: །འོད་སྲུང་དེ་ནས་ཁྱེའུ་ཆོས་དང་། ཆོས་བཟང་གཉིས་ཀྱིས་ཕ་མ་ལ་གསོལ་བ་བཏབ་ནས་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་ལེགས་པ་ཁོ་ནར་རབ་ཏུ་འབྱུང་བའི་ཕྱིར་མངོན་པར་བྱུང་ངོ་།
en: Then, Kāśyapa, the two youths Dharma and Sudharma asked for their parents’ consent and faithfully renounced and went forth from their home into homelessness, just as is proper.

source: །དེ་གཉིས་རང་གི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་མངོན་པར་འབྱུང་བའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །རབ་འབྱུང་སངས་རྒྱས་རྣམས་ཀྱིས་བསྔགས། །ངེས་འབྱུང་དེ་བཞིན་གཤེགས་པས་བསྔགས།
en: When the pair renounced their own city, they spoke these verses: “ ‘The buddhas praise going forth; The tathāgatas praise renunciation.

source: །ཁྱིམ་གནས་ཉོན་མོངས་གནས་པ་སྟེ། །དཀར་ཆོས་རྣམ་པར་འཇིག་པར་བྱེད། །གང་ཞིག་དཀར་པོའི་ཆོས་རྣམས་ནི།
en: Household life is the abode of the afflictions, The destroyer of virtuous qualities. “ ‘

source: །ཉམས་པར་མི་འགྱུར་འཕེལ་འདོད་པ། །རབ་ཏུ་འབྱུང་བར་བྱ་བའི་ཕྱིར། །འཇིག་རྟེན་མགོན་ཐང་མྱུར་དུ་སོང་།
en: If you want to increase, not spoil, Your virtuous qualities, Go quickly to the lord of the world In order to go forth! “ ‘

source: །བསྐལ་པ་བྱེ་བར་རབ་སྤྱད་ཀྱང་། །འདོད་པ་རྣམས་ལ་ངོམས་པ་མེད།
en: Even if indulged for ten million eons, Desires are insatiable.

source: །ཁྱིམ་ན་གནས་པ་འདོད་རྣམས་ཀྱིས། །མི་ངོམས་བཞིན་དུ་འཆི་བར་འགྱུར།
en: Living at home, one dies With one’s desires unsatisfied. “ ‘

source: །ཇི་ལྟར་རྒྱ་མཚོ་ཆུ་ཀླུང་རྣམས། །འབབ་པས་ངོམས་པར་མི་འགྱུར་བ། །དེ་བཞིན་བྱིས་པ་འདོད་རྣམས་ལ། །བསྟེན་པས་ནམས་ཀྱང་ངོམས་མི་འགྱུར།
en: Just as rivers are not quenched By flowing into the ocean, So the immature will never be satisfied Through following their desires. “ ‘

source: །དཔེར་ན་མེ་ནི་རྩྭ་དག་དང་། །ཤིང་གིས་ནམས་ཀྱང་ངོམས་པ་མེད། །དེ་བཞིན་བྱིས་པ་འདོད་རྣམས་ལ། །བསྟེན་པས་ངོམས་པར་འགྱུར་བ་མེད།
en: Just as, by analogy, there is no satisfying fire With grass and wood, So the immature will not be satisfied Through following their desires. “ ‘

source: །འཇིག་རྟེན་རྣམ་པར་འདྲེན་རྣམས་ཀྱིས། །འདོད་པ་འདི་དག་ཆགས་པར་གསུངས།
en: The guides of the world Teach that those desires are attachments.

source: །དེ་ཕྱིར་ཆགས་པ་ཡོངས་སྤངས་ཏེ། །རབ་ཏུ་འབྱུང་ཕྱིར་མངོན་བྱུང་ཤིག །
en: So abandon attachments And renounce them to go forth! “ ‘

source: འཇིག་རྟེན་མགོན་པོ་བླ་ན་མེད། །སྔ་མ་འགའ་ཡང་གང་གི་ཕྱིར། །ཁྱིམ་གྱི་གནས་ན་གནས་མཛད་ནས། །བླ་མེད་བྱང་ཆུབ་བརྙེས་པ་མེད།
en: Previous unsurpassed lords of the world Never, for any reason, Found unsurpassed awakening While living at home. “ ‘

source: །སྔོན་གྱི་སངས་རྒྱས་འཇིག་རྟེན་མགོན། །གང་སུ་མྱ་ངན་འདས་གྱུར་པ། །ཀུན་གྱིས་དགོན་པར་རབ་དགོན་དུ། །བླ་མེད་བྱང་ཆུབ་བརྙེས་པར་གྱུར།
en: Past buddhas, lords of the world, Who attained nirvāṇa All found unsurpassed awakening In the forest or wilderness. “ ‘

source: །དེ་ཕྱིར་སངས་རྒྱས་རྣམས་ཀྱིས་ནི། །བསྟེན་པའི་དགོན་པ་དེ་སློབས་ལ། །ཁྱིམ་གནས་སྲེད་པ་སྤོང་བྱོས་དང་།
en: So, train in the forests To which the buddhas resorted, And give up craving your home.

source: །དེས་ནི་བདེ་ལེགས་ཉིད་དུ་འགྱུར། །གང་ཞིག་ཁྱིམ་ན་གནས་ནས་ནི།
en: That will bring you happiness. “ ‘

source: །སྟོང་གསུམ་ཐམས་ཅད་རིན་ཆེན་གྱིས། །རབ་ཏུ་བཀང་སྟེ་འཇིག་རྟེན་གྱི། །མགོན་ལ་ཡོན་དུ་འབུལ་བྱེད་ལ། །མཁས་པ་གང་ཞིག་ཡིད་བྱུང་ཞིང་། །ཉེས་པ་ཤེས་ནས་ཁྱིམ་སྤངས་ཏེ། །སངས་རྒྱས་རྗེས་སུ་སློབ་བྱེད་ལ། །རབ་ཏུ་འབྱུང་བ་ཚོལ་བྱེད་ཅིང་། །རབ་ཏུ་འབྱུང་བ་བཙལ་ནས་ཀྱང་། །གཡེལ་བ་མེད་པས་འདོད་རྣམས་དང་། །ཁྱིམ་གྱི་གནས་ལ་མི་ལྟ་བར། །གོམ་པ་བདུན་ནི་འདོར་བྱེད་ན། །བསོད་ནམས་ཕུང་པོ་དེ་ལ་ནི། །སྔ་མས་རིན་གྱི་ཆར་མི་ཆོག །
en: Suppose someone who lives at home Fills the whole billionfold universe With jewels and gives it as a gift To the lords of the world; “ ‘If a wise person gives up their home, Averse to and aware of its drawbacks, And emulates the buddhas, Seeking to go forth, “ ‘And after seeking to go forth Unhesitatingly takes seven steps, Paying no heed to desires Or home, “ ‘The former’s is not worth a fraction Of the merit that person amasses.

source: དེ་ཕྱིར་སངས་རྒྱས་བསྔགས་པ་ཡི། །རབ་ཏུ་འབྱུང་ཕྱིར་མྱུར་དུ་དེང་།
en: Therefore, quickly proceed in going forth, Which was praised by the buddhas! “ ‘

source: །གང་ལ་ཆགས་པ་ཡོད་མིན་པའི། །ཤེས་པས་རྟག་ཏུ་ངོམས་མེད་ན། །ཆགས་པ་ཀུན་ལས་རྣམ་འདས་པའི། །སངས་རྒྱས་དམ་པ་ཉིད་འཐོབ་འགྱུར།
en: If one is never sated By knowledge in which there is no attachment, One will attain sublime buddhahood That transcends all attachment. “ ‘

source: །མྱུར་དུ་དགོན་པར་གནས་བྱེད་ན། །འདོད་པའི་སྲེད་པ་སྤོང་འགྱུར་ཏེ། །ཉེས་པ་ཇི་བཞིན་རྣམ་རིག་ནས། །དེ་དག་ལས་ནི་སེམས་ལྡོག་འགྱུར།
en: If one swiftly settles in the forest, One abandons the craving of desire, Becomes aware of one’s faults as they are, And turns the mind away from them. “ ‘

source: །ཁྱིམ་ནི་མྱུར་དུ་སྤངས་ནས་སུ། །དགོན་པ་ལ་ནི་གནས་གྱུར་པ། །མཁས་པ་ཡང་དག་མཐོང་བ་རྣམས། །སངས་རྒྱས་རྣམས་ཀྱི་རྗེས་སུ་སློབ།
en: Swiftly abandoning home And dwelling in the forest, The wise who see correctly Emulate the buddhas. “ ‘

source: །གང་དག་བྱང་ཆུབ་ཕྱིར་བརྩོན་པ། །དེ་དག་དབེན་པ་སྟེན་བྱེད་ཅིང་། །དེ་དག་དགོན་པར་དགའ་འགྱུར་ཞིང་། །དེ་དག་ཁྱིམ་ལ་དགའ་མི་འགྱུར།
en: Those who strive for awakening Keep to places of solitude, Delighting in the forest, Not delighting in homes. “ ‘

source: །དེ་ནི་སངས་རྒྱས་རྣམ་དག་གི །སྤྱོད་ཡུལ་གནས་དང་སྤྱོད་པ་སྟེ།
en: That is the state and conduct That is the pure domain of the buddhas.

source: །གང་ཞིག་ལམ་འདིར་འཇུག་འགྱུར་བ། །དེ་ལ་བྱང་ཆུབ་རྙེད་དཀའ་མིན།
en: For whoever enters this path, Awakening is not hard to find. “ ‘

source: །ཆགས་ལ་སོགས་པས་གཟིར་བ་ཡི། །སེམས་ཅན་གྲོལ་བྱེད་སུ་འདོད་པ། །དེ་ནི་ཁྱིམ་ན་གནས་པ་ཡིས། །སྐྲག་ཅིང་དགོན་པ་ཀུན་ཏུ་བསྟེན།
en: Whoever wants to free beings Who are tormented by attachment and so on Is afraid to live at home, Keeping entirely to the forest. “ ‘

source: །གང་ཞིག་བདུད་ལས་རྒྱལ་བ་དང་། །འཆི་མེད་གོ་འཕང་རྟོགས་པ་དང་། །འཁོར་ལོ་དམ་པ་བསྐོར་འདོད་པ། །དེས་ནི་དགོན་པ་བསྟེན་པར་གྱིས།
en: Whoever wants victory over Māra, Realization of the deathless state, And to turn the wheel of the sublime, Let them keep to the forest!’ “

source: །འོད་སྲུང་དེ་ལྟར་ཁྱེའུ་ཆོས་དང་།
en: Kāśyapa, the two youths Dharma and Sudharma spoke those verses as they left the city.

source: ཆོས་བཟང་གཉིས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲ་ཞིང་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ནས་ཕྱིར་བྱུང་ནས་བཅོམ་ལྡན་འདས་མེ་ཏོག་སྣ་ཚོགས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གཉིས་བཅོམ་ལྡན་འདས་ལས་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་ཐོབ་པར་འགྱུར་ལགས་སམ།
en: Then, having set out and arrived at the place where the Blessed One Myriad Flowers was, they prostrated at the feet of the Blessed One, and asked him, ‘Blessed One, please may we both obtain the going forth and ordination into monkhood from the Blessed One?’ “

source: འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་ཁྱེའུ་དེ་གཉིས་ཀྱི་ལྷག་པའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་ཁྱེའུ་དེ་གཉིས་རབ་ཏུ་ཕྱུང་ཞིང་བསྙེན་པར་རྫོགས་པར་མཛད་དོ།
en: Then, Kāśyapa, the Tathāgata Myriad Flowers, realizing the noble intention of the two youths, conferred the going forth and ordination into monkhood upon them.

source: །འོད་སྲུང་དེ་ནས་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱིས་ཁྱེའུ་དེ་གཉིས་རབ་ཏུ་བྱུང་བ་ཐོས་ནས་བུ་ཐུ་བོ་རྒྱལ་སྲིད་ལ་བཞག་སྟེ།
en: Kāśyapa, after King Nimi heard that the two youths had gone forth, he placed his eldest son in charge of the kingdom.

source: བུ་སྟོང་དུ་གཅིག་གིས་མ་ཚང་བ་རྣམས་དང་ཡང་ལྷན་ཅིག །བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ཡང་ལྷན་ཅིག །རྒྱལ་པོ་ལྔ་སྟོང་ཙམ་པོ་དེ་དག་དང་ཡང་ལྷན་ཅིག །སྐྱེ་བོ་ཕལ་པོ་ཆེ་གཞན་དག་དང་ཡང་ལྷན་ཅིག་ཏུ་ཐམས་ཅད་ཁྱིམ་གྱི་གནས་ལ་མི་ལྟ་བར་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་ལེགས་པ་ཁོ་ནར་རབ་ཏུ་འབྱུང་བའི་ཕྱིར་མངོན་པར་བྱུང་བར་གྱུར་ཏོ།
en: Then he and all but one of his thousand sons, eighty-four thousand women, the five thousand kings, and many other people, all of them paying no heed to their households, faithfully renounced and went forth from their homes into homelessness, just as is proper. “

source: །དེའི་ཚེ་ན་སྲོག་ཆགས་བྱེ་བ་ཐམ་པ་མངོན་པར་བྱུང་བར་གྱུར་ཏེ། དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At that time, ten million living beings went forth, and all set out and arrived at the place where the Tathāgata Myriad Flowers was.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་བཅོམ་ལྡན་འདས་ལས་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་ཐོབ་པར་འགྱུར་ལགས་སམ།
en: On arrival, they prostrated at the feet of the Blessed One and asked him, ‘Blessed One, please may we obtain the going forth and ordination into monkhood from the Blessed One?’ “

source: འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་སེམས་ཅན་དེ་དག་གི་ལྷག་པའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་སྐྱེ་བོའི་ཚོགས་དེ་དག་ཐམས་ཅད་རབ་ཏུ་ཕྱུང་ཞིང་བསྙེན་པར་རྫོགས་པར་མཛད་དེ། དགེ་སློང་གི་དངོས་པོ་ལ་རབ་ཏུ་བཀོད་དོ།
en: Then, Kāśyapa, the Tathāgata Myriad Flowers, realizing the noble intention of those beings, conferred the going forth and ordination upon all those assembled beings, establishing them in monkhood. “

source: །འོད་སྲུང་དེ་ནས་རྒྱལ་པོ་མུ་ཁྱུད་ཀྱིས་བུ་ཐུ་བོ་རྒྱལ་སྲིད་ལ་བཞག་པ་གང་ཡིན་པ་དེ་ཡང་ཞག་བདུན་འདས་པ་དང་། གཅིག་པུ་དབེན་པར་སོང་ནས་འདུ་ཤེས་ཀྱི་རྣམ་པར་རྟོག་པ་འདི་ལྟ་བུ་འདི་སྐྱེས་ཏེ། བདག་ལ་རྒྱལ་སྲིད་ཀྱིས་ཅི་བྱ།
en: Then, Kāśyapa, after seven days had passed, King Nimi’s eldest son, who had been placed in charge of the kingdom, went by himself into solitude, giving rise to conceptions and thoughts such as these: ‘What use to me is a kingdom?

source: དབང་ཕྱུག་གིས་ཀྱང་ཅི་བྱ་སྟེ།
en: And what use is dominion?

source: བདག་འདོད་པ་ལྷུར་ལེན་ཅིང་འདོད་པའི་འཆིང་བས་བཅིངས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་སྤང་བར་ནི་མི་བྱའོ་སྙམ་ནས་དེས་དེའི་མདོ་ལ་རབ་ཏུ་འབྱུང་བའི་སེམས་ཆེན་པོ་བསྐྱེད་དེ།
en: As I am intent on desires and bound by the fetter of desires, I shall not give up on unsurpassed, perfect awakening.’ With this thought, he instantly developed the great intention to go forth.

source: དེ་ཚེས་བཅོ་ལྔ་ཟླ་བ་ཉ་བའི་ཚེ་གླིང་ཆེན་པོ་བཞི་པོ་དག་ཏུ་རྒྱུ་བའི་ཚེ་ན་དེས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཁོ་བོའི་ཕ་མ་ཕུ་ནུ་དང་། །རྩ་ལག་རྣམས་ཀྱང་རབ་འབྱུང་ཕྱིར། །ངེས་པར་བྱུང་སྟེ་ཆོས་དོན་ཕྱིར། །སྲོག་ཆགས་བྱེ་བ་ཐམ་པ་བྱུང་།
en: At that time, on the fifteenth day, when the full moon was passing over the four continents, he spoke these verses: “ ‘Because my parents, brothers, And relatives have renounced and gone forth, And millions of living beings have Renounced for the sake of the Dharma, “ ‘What use to me is a home?

source: །ང་ལ་ཁྱིམ་གྱིས་ཅི་བྱ་སྟེ།
en: I shall also go away.

source: །བདག་ཀྱང་དེར་ནི་འགྲོ་བར་བྱ། །གལ་ཏེ་ཁྱེད་ཅག་འདོད་གྱུར་ན། །ང་ནི་ཁྱེད་ཀྱི་ཡོངས་འདྲེན་ཏེ།
en: If you wish, I shall lead you. “ ‘

source: །གང་དག་རབ་ཏུ་འབྱུང་བའི་ཕྱིར། །སེམས་སྐྱེད་བྱེད་པ་དེ་དག་ནི། །ཁོམ་ལྡན་ཤིན་ཏུ་རྙེད་དཀའ་བས། །ང་དང་འགྲོགས་ཏེ་མྱུར་དུ་འདོང་།
en: For those who intend To go forth, It is very hard to find the leisure to do so, So come along with me quickly! “ ‘

source: །གང་དག་ཁྱིམ་ནས་ཁྱིམ་མེད་པར། །རབ་འབྱུང་སེམས་སྐྱེད་མི་བྱེད་པ། །དེ་དག་བདེན་ཆོས་གནས་གྱིས་ལ། །ཁྱིམ་ནི་ལེགས་པར་བསྲུང་གྱིས་ཤིག །
en: Those who do not intend to go forth From home into homelessness Should, by sustaining the true Dharma, Protect their households well.’ “

source: འོད་སྲུང་དེ་ལྟར་རྒྱལ་བུ་གཞོན་ནུ་དེས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་པ་ན། གླིང་ཆེན་པོ་བཞི་པོ་དེ་དག་ནས་གང་ཁྱིམ་ན་གནས་པ་ལ་སེམས་དགའ་བའི་སེམས་ཅན་ནི་གཅིག་ཀྱང་བྱུང་བར་མ་གྱུར་ཏེ།
en: Kāśyapa, when the young prince spoke those verses, of all the beings on the four continents there was not a single one who delighted in living at home.

source: ཐམས་ཅད་རབ་ཏུ་བྱུང་བའི་སེམས་དང་ལྡན་ཞིང་རབ་ཏུ་འབྱུང་བ་ལ་གཞོལ་བ་དང་། མངོན་པར་འབྱུང་བའི་བསམ་པ་དང་ཆས་ཏེ་གནས་པར་གྱུར་ཏོ།
en: They were all intent on going forth, determined to go forth, and departed with an attitude of renunciation. “

source: །འོད་སྲུང་དེ་ནས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྣ་ཚོགས་དེས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་ལྷག་པའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་གྱི་འཁོར་དང་བཅས་པ་དག་སྤྲུལ་པ་མཛད་དོ།
en: Then, Kāśyapa, the Tathāgata Myriad Flowers, realizing the noble intention of all those beings, created emanations of the Tathāgata, along with his attendant saṅgha of monks, in all the hamlets, towns, villages, surrounding regions, and royal palaces of all the four-continent universes. “

source: །འོད་སྲུང་དེ་ནས་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་སེམས་ཅན་གཅིག་ཀྱང་ཁྱིམ་ན་གནས་པར་མ་གྱུར་ཏེ། དེ་དག་ཐམས་ཅད་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་ལེགས་པ་ཁོ་ནར་རབ་ཏུ་བྱུང་ངོ་།
en: Then, Kāśyapa, not a single being in the four-continent universes remained in their home; all of them faithfully went forth from their homes into homelessness, just as is proper.

source: །དེ་ལྟར་རབ་ཏུ་བྱུང་བ་དེ་དག་ལ་མ་རྨོས་མ་བཏབ་པའི་འབྲས་སཱ་ལུའི་འབྲུ་དག་ཀྱང་བྱུང་བར་གྱུར།
en: That being so, grains of rice that had been neither ploughed nor sown came forth for those who had gone forth.

source: དཔག་བསམ་གྱི་ཤིང་དག་ལས་དཔག་བསམ་གྱི་རས་བཅོས་བུའི་གོས་རིན་པོ་ཆེ་དག་ཀྱང་བྱུང་བར་གྱུར་ཅིང་ལྷ་རྣམས་ཀྱང་དེ་དག་གི་གཡོག་དང་བསྙེན་བཀུར་བྱེད་པར་གྱུར་ཏོ།
en: Bejeweled, wish-fulfilling cotton robes appeared from wish-fulfilling trees, while the gods attended on them and paid them honor. “

source: །འོད་སྲུང་དགེ་སློང་ཆོས་དང་། ཆོས་བཟང་དེ་གཉིས་དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་ཀྱང་བརྩོན་འགྲུས་བརྩམས་ཤིང་གནས་པར་གྱུར་ཏེ།
en: Kāśyapa, after the two monks Dharma and Sudharma had gone forth in that way, they applied themselves diligently.

source: དེ་གཉིས་ལོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་གསུམ་གྱི་བར་དུ་ནམ་ཡང་རྨུགས་པ་དང་གཉིད་ཀྱིས་ཀུན་ནས་ནོན་པར་མ་གྱུར་ཅིང་ནམ་ཡང་ཟས་ཟ་བ་མ་གཏོགས་པར་འདུག་པར་མ་གྱུར་ཏེ།
en: For six hundred and thirty-three million years the pair were never overcome with sloth or sleepiness and, except to eat, never sat down.

source: འགྲོ་བ་དང་ལྡོག་པ་ཀུན་ཏུ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་བསྐྱེད་ཅིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དེ་ལ་ཡང་རློམ་སེམས་བྱེད་པར་མ་གྱུར་ཏོ།
en: Whenever they came or went they generated the thought of omniscience, without being conceited about the thought of omniscience.

source: །ལོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་གསུམ་པོ་དེ་དག་ལ་ཀུན་གྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྡོ་རྗེའི་གནས་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཀྱང་བསྒྲུབས་པར་གྱུར་ཏེ།
en: For those six hundred and thirty-three million years they accomplished the samādhis called all following and possessing the adamantine state.

source: དེ་གཉིས་སའི་ཕྱོགས་གང་དང་གང་དུ་འདུག་པ་དང་སྐྱིལ་མོ་ཀྲུང་བཅས་པར་གྱུར་པའི་སའི་ཕྱོགས་དེ་དང་དེ་དག་ཐམས་ཅད་རྡོ་རྗེའི་རང་བཞིན་དུ་ཀུན་ཏུ་གནས་པར་གྱུར་ཏོ།
en: Every place in which the pair sat cross-legged came to be adamantine in nature.

source: །ཕྱོགས་བཅུ་ཀུན་གྱི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དག་གིས་ཆོས་སྟོན་པ་རྣམས་ཀྱང་ཐོས་ཤིང་བཟུང་ངོ་།
en: They heard and retained the Dharma teachings of the hundred billion trillion buddhas in all the ten directions.

source: །དེ་ལྟར་ཐོས་ཤིང་བཟུང་ནས་ཀྱང་གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་པར་ཡང་གྱུར་ཏོ།
en: Having heard and retained them, they also taught them extensively to others. “
